<div style=" background-color: RGB(0,114,200);" >
<h1 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">PROJET 8 DATA ANALYST</h1>
<h2 style="margin: auto; padding: 20px 0; color:#fff; text-align: center">Movie Database Analysis and Cleaning
</h2>
</div>

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; ">Etape 1 - Importation des librairies et chargement des fichiers</h2>
</div>

<div style="border: 1px solid RGB(0,150,250);" >
<h3 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">1.1 - Importation des librairies</h3>
</div>

In [6]:
#Importation de la librairie Pandas
import pandas as pd

<div style="border: 1px solid RGB(0,150,250);" >
<h3 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">1.2 - Chargement des fichiers Excel</h3>
</div>

In [4]:
ls

Untitled.ipynb  actors.xlsx     casting.xlsx    movies.xlsx

In [7]:
actors = pd.read_excel("actors.xlsx")

In [8]:
casting = pd.read_excel("casting.xlsx")

In [9]:
movies = pd.read_excel("movies.xlsx")

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; ">Etape 2 - Analyse exploratoire des fichiers</h2>
</div>

<div style="border: 1px solid RGB(0,150,250);" >
<h3 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">2.1 - Analyse exploratoire du fichier actors</h3>
</div>

In [10]:
actors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Actor ID     5 non-null      int64
 1   Name         5 non-null      object
 2   Age          4 non-null      float64
 3   Nationality  5 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [11]:
actors.shape

(5, 4)

In [12]:
actors.isnull().sum()

Actor ID       0
Name           0
Age            1
Nationality    0
dtype: int64

In [13]:
actors.describe()

       Actor ID       Age
count  5.000000   4.00000
mean   3.000000  46.75000
std    1.581139   4.99166
min    1.000000  40.00000
25%    2.000000  45.25000
50%    3.000000  47.50000
75%    4.000000  49.00000
max    5.000000  52.00000

In [14]:
actors.head()

   Actor ID               Name   Age Nationality
0         1  Leonardo DiCaprio  48.0         USA
1         2       Kate Winslet  47.0          UK
2         3         Matt Damon  52.0         USA
3         4    Joaquin Phoenix   NaN         USA
4         5      Anne Hathaway  40.0         USA

<div style="border: 1px solid RGB(0,150,250);" >
<h3 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">2.2 - Analyse exploratoire du fichier casting</h3>
</div>

In [16]:
casting.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Cast ID   5 non-null      int64
 1   Movie ID  5 non-null      int64
 2   Actor ID  5 non-null      int64
 3   Role      5 non-null      object
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [17]:
casting.describe()

          Cast ID  Movie ID  Actor ID
count    5.000000  5.000000   5.00000
mean   103.000000  2.800000   2.60000
std      1.581139  1.643168   1.81659
min    101.000000  1.000000   1.00000
25%    102.000000  2.000000   1.00000
50%    103.000000  2.000000   2.00000
75%    104.000000  4.000000   4.00000
max    105.000000  5.000000   5.00000

In [18]:
casting.isnull().sum()

Cast ID     0
Movie ID    0
Actor ID    0
Role        0
dtype: int64

In [19]:
casting.head()

   Cast ID  Movie ID  Actor ID          Role
0      101         1         1    Lead Actor
1      102         2         1    Lead Actor
2      103         2         2  Lead Actress
3      104         4         4    Lead Actor
4      105         5         5  Lead Actress

<div style="border: 1px solid RGB(0,150,250);" >
<h3 style="margin: auto; padding: 20px; color: RGB(0,150,250); ">2.3 - Analyse exploratoire du fichier movies</h3>
</div>

In [21]:
movies.shape

(5, 6)

In [22]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Movie ID      5 non-null      int64
 1   Title         5 non-null      object
 2   Genre         5 non-null      object
 3   Release Year  5 non-null      int64
 4   Budget (M)    4 non-null      float64
 5   Revenue (M)   4 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 372.0+ bytes

In [23]:
movies.describe()

       Movie ID  Release Year  Budget (M)  Revenue (M)
count  5.000000      5.000000    4.000000     4.000000
mean   3.000000   2009.800000  168.000000  1634.750000
std    1.581139      8.167007   71.642632  1055.566317
min    1.000000   1997.000000   70.000000   677.000000
25%    2.000000   2009.000000  141.250000   790.250000
50%    3.000000   2010.000000  182.500000  1507.500000
75%    4.000000   2014.000000  209.250000  2352.000000
max    5.000000   2019.000000  237.000000  2847.000000

In [24]:
movies.isnull().sum()

Movie ID        0
Title           0
Genre           0
Release Year    0
Budget (M)      1
Revenue (M)     1
dtype: int64

In [25]:
movies.head()

   Movie ID         Title    Genre  Release Year  Budget (M)  Revenue (M)
0         1        Avatar   Sci-Fi          2009       237.0       2847.0
1         2       Titanic  Romance          1997       200.0       2187.0
2         3     Inception   Sci-Fi          2010         NaN        828.0
3         4         Joker    Drama          2019        70.0          NaN
4         5  Interstellar   Sci-Fi          2014       165.0        677.0

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; ">Etape  - Analyse </h2>
</div>

In [27]:
actors.head()

   Actor ID               Name   Age Nationality
0         1  Leonardo DiCaprio  48.0         USA
1         2       Kate Winslet  47.0          UK
2         3         Matt Damon  52.0         USA
3         4    Joaquin Phoenix   NaN         USA
4         5      Anne Hathaway  40.0         USA

In [28]:
actors_all = actors.fillna(actors["Age"].mean())

In [29]:
actors_all

   Actor ID               Name    Age Nationality
0         1  Leonardo DiCaprio  48.00         USA
1         2       Kate Winslet  47.00          UK
2         3         Matt Damon  52.00         USA
3         4    Joaquin Phoenix  46.75         USA
4         5      Anne Hathaway  40.00         USA

In [ ]:
#Experience Level in the actors table: categorize actors based on their age.

In [32]:
actors_all_sort=actors_all.sort_values(by="Age",ascending=False)

In [33]:
actors_all_sort

   Actor ID               Name    Age Nationality
2         3         Matt Damon  52.00         USA
0         1  Leonardo DiCaprio  48.00         USA
1         2       Kate Winslet  47.00          UK
3         4    Joaquin Phoenix  46.75         USA
4         5      Anne Hathaway  40.00         USA

In [35]:

def categorize_experience(age):
    if age < 30:
        return 'Junior'
    elif age < 50:
        return 'Mid-Level'
    else:
        return 'Senior'

actors_all_sort['Experience Level'] = actors_all_sort['Age'].apply(categorize_experience)
print(actors_all_sort)

   Actor ID               Name    Age Nationality Experience Level
2         3         Matt Damon  52.00         USA           Senior
0         1  Leonardo DiCaprio  48.00         USA        Mid-Level
1         2       Kate Winslet  47.00          UK        Mid-Level
3         4    Joaquin Phoenix  46.75         USA        Mid-Level
4         5      Anne Hathaway  40.00         USA        Mid-Level

In [ ]:
#Analyze the most profitable movies.

In [36]:
movies

   Movie ID         Title    Genre  Release Year  Budget (M)  Revenue (M)
0         1        Avatar   Sci-Fi          2009       237.0       2847.0
1         2       Titanic  Romance          1997       200.0       2187.0
2         3     Inception   Sci-Fi          2010         NaN        828.0
3         4         Joker    Drama          2019        70.0          NaN
4         5  Interstellar   Sci-Fi          2014       165.0        677.0

In [37]:
movies["Budget (M)"] = movies['Budget (M)'].fillna(movies['Budget (M)'].mean())

In [38]:
movies

   Movie ID         Title    Genre  Release Year  Budget (M)  Revenue (M)
0         1        Avatar   Sci-Fi          2009       237.0       2847.0
1         2       Titanic  Romance          1997       200.0       2187.0
2         3     Inception   Sci-Fi          2010       168.0        828.0
3         4         Joker    Drama          2019        70.0          NaN
4         5  Interstellar   Sci-Fi          2014       165.0        677.0

In [39]:
movies["Revenue (M)"] = movies['Revenue (M)'].fillna(movies['Revenue (M)'].mean())

In [40]:
movies

   Movie ID         Title    Genre  Release Year  Budget (M)  Revenue (M)
0         1        Avatar   Sci-Fi          2009       237.0      2847.00
1         2       Titanic  Romance          1997       200.0      2187.00
2         3     Inception   Sci-Fi          2010       168.0       828.00
3         4         Joker    Drama          2019        70.0      1634.75
4         5  Interstellar   Sci-Fi          2014       165.0       677.00

In [ ]:
# Most Profitable Movies:

In [46]:
movies['Profit (M)'] = movies['Revenue (M)'] - movies['Budget (M)']
print(movies)

   Movie ID         Title    Genre  Release Year  Budget (M)  Revenue (M)  \
0         1        Avatar   Sci-Fi          2009       237.0      2847.00
1         2       Titanic  Romance          1997       200.0      2187.00
2         3     Inception   Sci-Fi          2010       168.0       828.00
3         4         Joker    Drama          2019        70.0      1634.75
4         5  Interstellar   Sci-Fi          2014       165.0       677.00

   Profit (M)
0     2610.00
1     1987.00
2      660.00
3     1564.75
4      512.00

In [49]:
most_profitable_movies = movies.groupby("Genre")[["Profit (M)","Revenue (M)"]].mean()

In [50]:
most_profitable_movies

          Profit (M)  Revenue (M)
Genre
Drama    1564.750000  1634.750000
Romance  1987.000000  2187.000000
Sci-Fi   1260.666667  1450.666667

In [51]:
# 
most_profitable_movies = movies.sort_values(by='Profit (M)', ascending=False)
print("Most Profitable Movies:")
print(most_profitable_movies[['Title', 'Profit (M)']])

Most Profitable Movies:
          Title  Profit (M)
0        Avatar     2610.00
1       Titanic     1987.00
3         Joker     1564.75
2     Inception      660.00
4  Interstellar      512.00

In [ ]:
# Count actors by nationality

In [52]:
# Count actors by nationality
actor_nationality_distribution = actors['Nationality'].value_counts()
print("Actor Nationality Distribution:")
print(actor_nationality_distribution)

Actor Nationality Distribution:
Nationality
USA    4
UK     1
Name: count, dtype: int64

In [ ]:
#Average Budget and Revenue by Genre:

In [53]:
# Group by genre and calculate average budget and revenue
average_genre_stats = movies.groupby('Genre')[['Budget (M)', 'Revenue (M)']].mean()
print("Average Budget and Revenue by Genre:")
print(average_genre_stats)

Average Budget and Revenue by Genre:
         Budget (M)  Revenue (M)
Genre
Drama          70.0  1634.750000
Romance       200.0  2187.000000
Sci-Fi        190.0  1450.666667